[
  {
    "id": 1,
    "description": "We are growing! Join Jordan’s Furniture for this newly created opportunity in our Marketing Department. The Integrated Marketing Manager leads all day-to-day development and implementation of our marketing programs calendar, including brand campaigns, promotions, charity and entertainment efforts. This role will provide cross-functional leadership to ensure merchandising, e-commerce, social, email, content, community, and in-store activations are best-in-class, fully integrated and deliver against our marketing objectives. This is a hybrid position located in Dedham, MA. Why you will love this job.Team atmosphere – We’re all family here!Innovation- Stay on the cutting edge of industry trends and leverage new technologies for innovative campaignsImpactful Contribution – Help shape our brand narrativeDynamic Challenges – No two days are the sameWhy you will love Jordan's Furniture.Stability – we are a growing, stable companyGreat Benefits – medical, dental, vision and more!Unique CultureEmployee Discount\nResponsibilitiesLeads day-day marketing calendar development, promotional cycles and integrated content planning.Develops and communicates marketing project brief requirements & strategic direction for internal and external (agency) resources.Uses consumer, market, and competitive insights to proactively identify impactful marketing initiatives and campaigns.Manages omni-channel marketing plan delivery in collaboration with Media, E-commerce, PR, Social, Email and Creative teams, including delivery of break-through creative ideas, journey mapping and KPI achievement.Develops and manages innovative in-store marketing activations, including events and signage.Creates impactful plan presentations and communicates plan updates to internal stakeholders.Manages brand team marketing budgets as appropriate, including quarterly and annual planning.Manages and co-ordinates vendor marketing opportunities, overseeing bedding co-op marketing plans as primary day-to-day liaison with key merchandise, category & industry partners.Brand steward works closely with Media, Creative, Ecommerce and Merchandising teams to maintain brand voice/identity throughout all executions.Shares knowledge of industry trends and competitive trends; monitors retail, fashion and furniture news and competition; interprets into actionable insights and continues to bring forward elevated and new thinking.Support any other function, responsibility or opportunity as assigned.\nQualificationsBachelor’s Degree or equivalent.5-7 years consumer marketing, retail industry experience; Including proven track record managing and executing integrated campaigns across multiple disciplines.Knowledge and experience with digital marketing & in-store activations.Business acumen, solid problem-solving skills and resourcefulness.Detail oriented, with strong organizational skills; Ability to manage & prioritize a large volume of disparate programs.Creative thinker and idea generator with ability to convert ideas to proof-of-concept, inspire others to do the same.Strong leadership and influencing skills, with a collaborative approach.Demonstrated ability bringing together teams with various backgrounds, perspectives, and levels of authority.Strong communication and presentation skills, with experience developing, writing and presenting briefs & plans.Entrepreneurial spirit and willingness to build out new function.\nJordan’s prides itself on having a strong, loyal J-Team. We recognize we are ‘One Team, One Goal’ working together to continue to strengthen Jordan’s place in the market and as an employer of choice. We know that you are here to support your family and we are here to support you! If this speaks to you, then it’s time to talk.  Jordan’s Furniture is an Equal Opportunity Employer.",
    "length": 3796
  },
  {
    "id": 2,
    "description": "Provides comprehensive emergency medical care to the critically ill and injured during helicopter and ambulance transport from accident scenes, and referring hospitals, under the direction of medical control physicians. Receives direct supervision from the Operations Managers. May at times receive functional supervision from the VP Director, AVP Clinical Operations, and Medical Director. Must maintain a weight not to exceed 250 pounds in gear. Required to work in confined space with exposure to extreme temperatures, vibration and altitude; and to stand for extended periods of time. Required to physically lift and transfer patients, and lift and move equipment used for patient care and other sensory facility to provide patient care. Communicates directly and uses aircraft headsets, radios and telephones with patients, physicians, and other staff in emergency and daily patient care activities. May be exposed to personal safety hazards in both air and ground transport.\n\nEducation\n\nHigh School Diploma or GED required  Successful completion of an approved Paramedic course required  Specialized and/or advanced clerical, technical or other vocational training acquired during 1 - 2 years of additional job-related training preferred \n\nExperience\n\n 3 years experience as an NREMT-P required  Significant field experience in a high acuity, high volume EMS system, and/or pre/intra hospital transport experience preferred \n\nLicenses and Certifications\n\nNREMT - National Registry of Emergency Medical Technicians-Paramedic required LP - Licensed Paramedic in the District of Columbia within 30 Days required LP - Licensed Paramedic in Maryland required LP - Licensed Paramedic in Virginia preferred CPR - Cardiac Pulmonary Resuscitation (includes BLS and NRP) for healthcare providers from either the American Heart Association (AHA) or American Red Cross within 90 Days required  Additional unit/specialty certifications may vary by department or business unit. ACLS - Advanced Cardiac Life Support Certification required PALS - Pediatric Advanced Life Support Certification required  PHTLS within 180 Days required orHealth Services \\ Transport Prof Adv Trauma Crse - TPATC within 180 Days required orATLS - Advanced Trauma Life Support Certification within 180 Days required orATCN - Advanced Trauma Care Nurse Certification within 180 Days required Health Services\\NRP - Neonatal Resuscitation Certification within 90 Days required STABLE - Neonatal Certification Certification within 90 Days required NIH - National Institute of Health Stroke Scale Certification within 90 Days required FEMA ICS 100 Course (Federal Emergency Management Agency - Incident Command System) prior to release from orientation required FEMA ICS 200 Course (Federal Emergency Management Agency - Incident Command System) prior to release from orientation required FP-C - Flight Paramedic - Certified from the Board for Critical Care Transport Paramedic Certification (BCCTPC) within 2 years required orCCP-C - Critical Care Paramedic - Certified from the Board for Critical Care Transport Paramedic Certification (BCCTPC) within 2 years required DL - Valid State Driver's License in good standing required  No more than four points assigned to driver's license and must maintain a satisfactory driving record (no more than four points).  Completion of approved Emergency Vehicle Operations Course (e.g., CEVO, EVOC) prior to release from orientation required Delivers expert patient care in helicopters and ambulances to multiple patient types including scene work, adult subspecialties, pediatrics, and high-risk obstetrics. Assesses patient care needs, establishes priorities and delegates tasks to peers and ancillary support staff as appropriate.Assesses the needs of patients with highly complex problems. Identifies current and potential complex problems, critically analyzes trends and changes in patient status, and plans appropriate interventions directly or indirectly through other nurses and paramedicsPerforms basic and advanced airway techniques and treatment modalities, including oxygen therapy, airway maintenance, assisted ventilation, insertion of supraglottic airways, nasal and orotracheal intubation, rapid sequence pharmacological induction to facilitate intubation, surgical cricothyroidotomy, and needle thoracostomy.Administers and maintains pharmacologic agents and intravenous fluids at the scene and during inter-hospital transfer.In collaboration with the Critical Care Transport Specialist - RN, monitors and evaluates invasive and non-invasive techniques/procedures and their therapeutic effects, including the monitoring and operation of the intra-aortic balloon pump (IABP), Ventricular Assist Devices (VAD), and intracranial monitoring devices during transport. Troubleshoots these devices, recognizes problems, and makes necessary corrections. Recognition and intervention of abnormal parameters includes potentially lethal cardiac dysrhythmias requiring electric cardioversion and defibrillation.Performs a variety of clinical duties including, but not limited to: insertion of nasal and oral gastric tubes and management of autologous blood transfusion systems. Initiates and maintains venous access and intraosseous lines.Obtains patient information, including detailed reports, when appropriate, and disseminates all necessary information to appropriate medical staff, per protocol. Responsible for monitoring and recording all patient data and completion of all appropriate clinical documentation in a timely manner.Maintains program readiness and ensure cleanliness and appropriate par levels of supplies used by MedSTAR Transport. Ensures helicopter or ambulance readiness with daily review of equipment and supplies and records findings on daily vehicle checklists.Ensures system readiness post-transport. Ensures that par stock levels of equipment at remote bases are maintained and informs MedSTAR leadership of supply needs, as necessary.Establishes and maintains professional radio communications with MedSTAR Communications Center and all other agencies, adhering to all FCC protocols.Support regulatory requirements, inspection readiness (e.g., DC Health, TJC, MIEMSS, CAMTS, etc.) and other identified quality metrics.Ensures safe operations during transport-related activities. Assists with helicopter safety training as directed by pilot in command. Also ensures safe operations during ambulance related activities in coordination with Emergency Vehicle Operator.Evaluates and documents risks and hazards on all transports and in in daily operations in conjunction with current risk assessment and reporting tools as part of the Safety Management System.Acts as safety officer for specialty team flights, including neonatal transports, organ recovery transports, etc.Assists in the orientation of new Critical Care Transport Specialists to their role during air and ground transport.Participates in ongoing education, marketing, statistical and quality assurance tasks, projects, and committees as assigned. Provides input to the ongoing clinical evaluation of staff, including peer-to-peer evaluation of clinical care and documentation.Participates in the formulation, implementation, maintenance and evaluation of unit goals, objectives, policies and procedures as appropriate, and assumes responsibility for the achievement of unit goals.Chairs and or participates in at least one unit-based committee or project. Participates in data research process on unit-based research projects as appropriate.Participates in the implementation of unit assessments and audits, including quality assurance and patient classification, product evaluation and product utilization.Demonstrates the initiative to seek out current and new evidence based practices that address patient care issues, and communicates relevant research findings to staff.",
    "length": 7878
  },
  {
    "id": 3,
    "description": "About The Company And Opportunity\n\nOur client is a growing companyClient has a proven track record of promoting employees from within, they have a solid reputation of cross trainingThe firm boasts exceptional work-life balanceWork closely with a top tier management teamThere is significant opportunity to learn new skills and be part of a team-oriented culture\n\nOverview Of The Accountant Role\n\nRecord cash payments daily and track in spreadsheetReview and confirm balance, freight, and sales tax on invoices; post Accounts Payable batches to general ledgerReview final checks weekly for AP/ARPrepare journal entries for cash transactionsMonthly closings - prepare sales tax returns for two regions; prepare balance sheet reconciliations for all US locations; communicate with plant managers regarding expensesPrepare balance sheet reconciliations for international locations quarterly\n\nPreferred Qualifications For The Accountant Role\n\nAssociate's or Bachelor's Degree in Accounting, Finance or related field3+ years of experience in a similar roleProficiency with Microsoft ExcelComfortable working in a major ERPDemonstrated ability to work in a leadership role\n\n#INAPR2024\n\nSkills: journal entries, balance sheets, monthly close, sales tax, lead Accounting team, balance sheet reconciliations\n\nClick here to apply online",
    "length": 1325
  },
  {
    "id": 4,
    "description": "We are Quantcast. A global Demand Side Platform (DSP) powered by AI. Rooted in our DNA is a strong foundation of measurement and consumer analytics, enabling us to empower marketers to reach audiences and achieve measurable advertising outcomes across the Open Web.\n\nSince 2006, Quantcast has consistently set the industry standard by introducing groundbreaking initiatives such as the first measurement platform for digital publishers and the first AI-powered DSP. If you're prepared to be part of an enthusiastic team that crafts cutting-edge solutions, then Quantcast is the ideal place for you.\n\nAs an Account Executive, Corporate Sales you will focus on educating and evangelizing Quantcast products with marketers and agencies. We are building services that will radically change the digital media landscape, and are looking for talented individuals who will help us drive that message into the market.\n\nResponsibilities\n\nActively identify, engage, and close new business to regularly meet and exceed sales goals Partner with business leaders across media organizations to understand their needs and properly execute goalsSolution-focused selling, presenting technical solutions to senior-level executives of mid-market and enterprise companies Build an intimate understanding of Quantcast products and their place in the industry\n\nRequirements\n\n3+ years of business development or sales experience in the digital advertising, publishing, or media spaceConsultative sales approach and experience in full sales cycleBuild relationships with clients of all levels (media planners to senior executives)Experience driving the sales cycle from sourcing to closing to leading a strategic partnership Deep understanding of the fundamentals of online advertising processes and technologyBA/BS Required\n\nBonus Points\n\nExisting relationships with C-level and executive contacts in the online media industry preferred\n\nThe expected base salary range for this position is $59,500 - $80,500 with OTE $108,300 - $146,500\n\nUltimately, in determining your offer, we will take into consideration your geographic location, relevant experience and expertise, and other job-related factors. Furthermore, full-time roles are eligible for a bonus, equity, and benefits (depending on your location) which include hybrid work, vacation, medical, dental, and vision insurance, and retirement plans. Please see our Careers page for additional information.\n\nFounded in 2006 and headquartered in San Francisco, Quantcast has employees in 18 offices across 10 countries. We are committed to building an inclusive and diverse environment where everyone can be their authentic self. We work to ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nRecognizing the importance of flexible work environments, Quantcast operates in a hybrid work model. This model gives employees the opportunity to work from home two days a week and work in the office for team collaboration for the remainder of the time. Our hybrid model may differ based on location or team, so please consult with your hiring manager for further information. All hybrid employees can also work remotely for two weeks each year or, if eligible, apply for our fully remote work program. We strongly encourage vaccination for all Quantcast employees as a way to stop the spread of COVID and protect yourself and others.",
    "length": 3585
  },
  {
    "id": 5,
    "description": "Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status. EEO/AA/M/F/Disabled/Vets\n\nJob Description :\n\nAbout News Corp:\n\nNews Corp is a global diversified media and information services company focused on creating\n\nand distributing authoritative and engaging content to consumers and businesses throughout\n\nthe world. The company comprises businesses across a range of media, including: news and\n\ninformation services, book publishing, digital real estate services, cable network programming in\n\nAustralia and pay-TV distribution in Australia.\n\nNews Corp seeks to hire individuals who work well in a fast pace team-driven environment, are highly\n\nmotivated, intelligent, have sound judgment, and have demonstrated excellence in prior\n\nendeavors. We seek candidates with good problem-solving skills. These include the ability to\n\nidentify problems and issues, assess possible solutions, implement the best solution, and\n\ndesign protocols to prevent recurrence.\n\nJob Description: Learning and Development Director\n\nWe are seeking a highly motivated, hands-on Learning and Development Director to join our global Talent Development team based in New York, reporting to the Global Head of Talent Development.\n\nThe role will be responsible for designing, implementing and evaluating learning solutions that drive business impact. \n\nAs an individual contributor the role requires a solid understanding of the learning and development landscape including instructional design and the ability to execute a learning agenda that drives a high culture of learning. \n\nThe ideal candidate is task driven with the mental agility to move and execute at pace, seeing tasks and projects through to completion. \n\nAbout the Role:\n\nPartner with business leaders and HR Business Partners to create and advance learning strategies to build leadership and capability development that drive commercial outcomesDesign and deliver learning and development programs that are both engaging and interactive through a variety of mechanisms including presentations, e-learning, videos, job aids and other relevant resourcesUtilize instructional design expertise to create effective learning programs that cater to different levels of capability and expertise Partner with external vendors to facilitate learning programs in a variety of formats such as classroom and virtualBuild and manage credible relationships with external vendors including existing relationships in place for next generation learning platformsProvide support on annual employee engagement and pulse surveysEvaluate and report on the ROI of learning strategies to business impactCreate metrics, reporting and data-driven insights to share with key stakeholdersStay up to date with industry trends and best practices in learning and development and deploy innovative approaches within the context of News Corp\n\nQualifications:\n\nA minimum of 10 years in a Learning and Development role or equivalent experienceExpertise in talent development, leadership development and the ability to apply this expertise through pragmatic solutions to fit business needsA track record of designing and delivering development initiatives across leadership and capability developmentAbility to multitask, prioritize, execute and manage multiple programs of work with a variety senior stakeholdersStrong attention to detail and ability to deliver with impeccable accuracy and qualityAbility to manage ambiguity and complexityCommercially focused, with excellent interpersonal communication skills (verbal and written)Confident working with senior stakeholders, anticipating the business view, and building credible relationshipsBachelor’s Degree or equivalent work experience in a related fieldAssessment or coaching accreditations a plus (e.g., Hogan, DiSC, Social Styles etc.)\n\nJob Category:\n\nPay Range: ($135,000) - ($165,000)\n\nWe recognize that attracting the best talent is key to our strategy and success as a company. As a result, we aim for flexibility in structuring competitive compensation offers to ensure we are able to attract the best candidates. The quoted salary range represents our good faith estimate as to what our ideal candidates are likely to expect, and we tailor our offers within the range based on the selected candidate's experience, industry knowledge, location, technical and communication skills, and other factors that may prove relevant during the interview process.\n\nPay-for-performance is a key element in our strategy to attract, engage, and motivate talented people to do their best work. Similarly to salary, for bonus eligible roles, targets are set based on a variety of factors including competitive market practice.\n\nFor benefits eligible roles, in addition to cash compensation, the company provides a comprehensive and highly competitive benefits package, with a variety of physical health, retirement and savings, caregiving, emotional wellbeing, transportation, and other benefits, including \"elective\" benefits employees may select to best fit the needs and personal situations of our diverse workforce.",
    "length": 5220
  },
  {
    "id": 6,
    "description": "Cook\n\nJob Reference Number: 18518\n\nEmployment Type: Full-Time, OnsiteSegment: Corrections\n\nBrand: Summit\n\nState: Georgia (US-GA)\n\nThe Role at a glance:\n\nWe are looking to add an experienced cook to work with a highly motivated and energetic kitchen staff in our Marietta, GA location for our corrections division. As a cook for Summit, you will have the opportunity to work in a fast-paced, efficient environment and cook delicious meals. If you are driven, passionate about preparing and serving high quality meals, and are looking for an organization that promotes your personal growth, this could be the right role for you. Please read on!\n\nWhat you'll be doing:\n\nQuality and portion control Food preparation Creative food presentation Maintaining kitchen Ensuring food is stored properly Following safe food handling policies, procedures and recipes \n\nWhat we're looking for:\n\nMust-haves: \n\nAt least one years’ prior culinary experience in a quality and high-volume establishment with an emphasis on scratch cooking Working knowledge of proper culinary methods, techniques, and standards. Excellent attention to detail and the ability to perform multiple tasks in fast-paced environment. Ability to use various kitchen equipment and tools as well as identify and differentiate food items. Customer service experience is required. \n\nNice-to-haves: \n\nFood handlers’ certification \n\nPay:\n\n$20.00 per hour\n\nOur Benefits:\n\nMedical (FT Employees)DentalVisionVoluntary UNUM offering for Accident, Critical Illness and Hospital IndemnityDiscount ProgramCommuter Benefits (Parking and Transit) EAP401kSick TimeHoliday Pay (9 paid holidays)Tuition Reimbursement (FT Employees)Paid Time Off \n\n#indeedelior\n\nAbout Summit:\n\nFocused on serving correctional institutions, Summit ensures that incarcerated people across the United States have access to delicious, healthy food at each meal. Working with Summit, you will have the opportunity to aid in this process and provide inmates with vital social interaction at mealtimes.\n\nAbout Elior North America:\n\nElior North America is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. We are committed to diversity and encourage applications from people of all backgrounds and abilities. We take pride in supporting the development of our employees and their skills at all levels and in fostering an environment of growth.\n\nAt Elior North America, we are committed to offering growth and advancement opportunities for all of our employees. The valuable skills and experience you’ve gained with Elior will propel you further in your career, whether with our corporate office or one of our brand segments.\n\nDisclaimer: This job description can be revised by management as needed.",
    "length": 2895
  },
  {
    "id": 7,
    "description": "DIVE IN TO A NEW CAREER WITH LESLIE'S: \n\nLeslie’s pool supplies is the “World’s Largest Retailer of Swimming Pool Supplies.” With over 1,000 retail stores in 39 states plus Pro, Service, E-Commerce, Production, and Distribution divisions, there are many career opportunities at Leslie’s. With over 60 years of providing the best-in-class products and solutions to our customers, there is nothing that we value more than the development and growth of our team. We strive to create a positive and fun atmosphere where our team members feel valued and are enthusiastic about the contributions they make to the success of Leslie’s.\n\nJob Overview: \n\nThe Lead Sales Associate will provide superior customer service to our customers and support the General Manager in all facets of retail operations to ensure the store is operating at optimal performance.\n\nResponsibilities: \n\nGreet and assist customers with their pool and spa care needsAccurately and timely complete sales transactions using the POS systemMaintain a welcoming store environmentAssist with merchandising and inventory controlPosition requires open and closing duties, including bank deposits\n\nQualifications: \n\nMust be at least 18 years of ageHigh School Diploma or Equivalent, or currently attending High SchoolA valid driver's license with reliable transportation6 months or 1 year of customer serviceAbility to achieve placement in the succession program. Excellent communication skills and proficiency with computers.Ability to complete required training within two months of hire. The ability to lift 50 lbs\n\nPay: $15.50 - $17.50 / hour\n\nLeslie’s recognizes a critical component to our continued success is our people. Leslie's is committed to developing and fostering a culture of diversity and inclusion within our company and the communities we serve. A key aspect of building a great team is valuing ideas from many viewpoints, which is why we place a priority on identifying and hiring talented individuals from all backgrounds and perspectives.",
    "length": 2017
  },
  {
    "id": 8,
    "description": "Overview\n\nShasta Regional Medical Center is a 226-bed acute care facility serving Northern California. The hospital offers a comprehensive range of services. Shasta Regional Medical Center is one of the nation’s 50 Top Cardiovascular Hospitals recognized by Watson Health and holds an ‘A’ Grade from Leapfrog Group, the nation's premier advocate of transparency in health care. The hospital is Joint Commission Certified for Stroke, Hip/Knee and Diabetes. They are a Five Star recipient for treatment of heart failure, respiratory failure and is named among the top 5% in the nation for patient safety.\n\nJoin an award-winning team of dedicated professionalscommitted to our core values ofquality,compassionandcommunity!\n\n Why Prime Healthcare? Shasta Regional Medical Center; a member of Prime Healthcare, offersincredible opportunities to expand your horizonsand be part of a community dedicated to making a difference.\n\nOur hospital is located alongside the beautiful Sacramento River where the sun shines 300 days a year! Only 1 hour away from Mt. Shasta and minutes away from Brandy Creek Beach, you’ll experience the sunshine state's fresh air, greenery, and more of what NorCal has to offer.\n\nShasta Regional Medical Center offers competitive compensation and a comprehensive benefits package that provides employees the flexibility to tailor benefits according to their individual needs. Benefits may vary based on collective bargaining agreement requirements and/or the employment status, i.e. full-time or part-time.\n\nOur Total Rewards package includes, but is not limited to:\n\nPaid time off401K retirement planOutstanding Medical, Dental, Vision coverageTuition reimbursementMany more voluntary benefit options\n\nWe are an Equal Opportunity Employer and do not discriminate against applicants due to veteran status, disability, race, gender, gender identity, sexual orientation, or other protected characteristics. If you need special accommodation for the application process, please contact Human Resources. Know Your Rights: https://www.eeoc.gov/sites/default/files/2022-10/EEOC_KnowYourRights_screen_reader_10_20.pdf\n\nResponsibilities\n\nPerforms security services, including electronic surveillance, and systematic manual Security Officers’ rounds. Coordinates facility response to various potential problems for patients, employees, and visitors.Enforces policy & procedure, ensuring equitable enforcement.Follows guidelines and perpetual monitoring techniques, towards establishing a safe workplace for employees and a safe environment of care.Works with the Environment of Care committee to ensure a multi-disciplinary approach to security and safety.Participates in employee awareness and education.Driving as needed for company business.\n\nQualifications\n\nEDUCATION, EXPERIENCE, TRAINING\n\n Experience in Healthcare security or related field preferred State Guard Certification Registration Card High School Diploma or Equivalent required.\n\nFacility Specific Requirements (facility May Require Items Listed Below)\n\n State Driver’s license upon hire Current DMV H6 report or Driving History Report\n\nA reasonable compensation estimate for this role, which includes estimated wages, benefits, and other forms of compensation, is $16.60 to $25.36. The exact starting compensation to be offered will be determined at the time of selecting an applicant for hire, in which a wide range of factors will be considered, including but not limited to, skillset, years of applicable experience, education, credentials and licensure.",
    "length": 3534
  },
  {
    "id": 9,
    "description": "Job Description\n\nWhat is a Store Driver?\n\nEntry level store position capable of supporting delivery of parts to commercial customers. The role has the responsibility to deliver parts to our commercial customers and assist with task and inventory processes in the store. This position can be part time or full time and must be fleet safety certified.\n\nPrimary Responsibilities\n\n Safely deliver parts to customers as needed Pick and stage parts for customer orders Pick up returns and cores Drop off weekly / monthly sales flyer Daily collection of credit accounts\n\nSecondary Responsibilities\n\n Store Cleanliness including floors, bathrooms, facing, dusting, parking lot General stocking including truck stocking and back stock\n\nSuccess Factors\n\n Basic driving and navigation ability Ability to use delivery board system Friendly communication Ability to locate and stock parts Safety knowledge and skills Operating inventory systems (Back stock) and store equipment\n\nEssential Job Skills Necessary For Success As a Driver\n\n Communicate effectively and build strong relationships with customers, peers and management Read and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals Use basic math accurately: add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals Ability to work an assortment of days, evenings, and weekends as needed\n\nPrior Experience that Sets a Driver up for Success\n\nAutomotive Parts Experience Is Preferred\n\nCertificates, Licenses, Registrations\n\nMust have a valid driver's license and be fleet safety certified\n\nPhysical Demands\n\nThe physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee will predominantly be walking or standing. The employee is required to be able to talk and hear, and use hands and fingers to handle or feel; reach with hands and arms; climb or balance; and stoop, kneel, crouch, or crawl. The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, depth perception, and ability to adjust focus.\n\nWork Environment\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee is usually working inside; however, they will occasionally be outside and exposed to various weather conditions while performing such tasks as installing batteries and wiper blades. The employee is also occasionally exposed to moving mechanical parts; high, precarious places; toxic or caustic chemicals; risk of electrical shock; explosives; and vibration. The noise level in the work environment is usually moderate.\n\nCompensation Range\n\n15.00 USD PER HOUR - 15.41 USD PER HOUR\n\nBenefits Information\n\nhttps://jobs.advanceautoparts.com/us/en/benefits\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttp://www.worldpaccareers.com/uploads/2/4/0/4/24047148/advance_auto_parts_--_california_candidate_privacy_notice.pdf\n\nR-0423913\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "length": 3744
  },
  {
    "id": 10,
    "description": "Job Description\n\nJoin our Mission to Lead the Future of Snacking AT Mondelēz International\n\nPart Time Nabisco Merchandiser\n\nJoin our team of Part Time Nabisco Merchandiser and fulfill the merchandising needs of our customers through communication & relationship building, stocking store shelves, and maintaining or changing out displays. Become an ambassador of world-famous brands like Oreo, Ritz, belVita, Chips Ahoy, Triscuit, among other delicious industry-leading snacks.\n\nRepresent Mondelēz in front of in-store employees and work closely with sales representative to optimize visibility of Mondelēz products on shelves and to construct promotional displays.Carry out in-store visits according to Mondelēz’ DSD Merchandising Steps.Ensure Nabisco leading brands (Oreo, Ritz, belVita, Chips Ahoy, Triscuit, among others) are well represented, stocked, and maintained through the implementation of Mondelēz’ guidelines.Ensure Sales Representative’s negotiated plans with store managers are being followed and communicate any issues with Mondelēz’ management team.Follow the daily schedule set by the merchandising manager to ensure the most efficient in-store service.Enhance seasonal sales, seasonal displays, and new product launches.Demonstrate positive, and upbeat attitude while representing Mondelēz in store.\n\n\nFor a closer view of what our merchandisers do: Day in the Life of a Mondelez Merchandiser\n\nWhat you can expect from us:\n\nHourly compensation rate of $17.00 an hourMileage reimbursement (according to company policy)Strong career advancement opportunities within the companyHealth and Well-Being ProgramEmployee Assistance Program (EAP)Reimbursement of business internet/data expenses up to $10/per month if company device is not provided.Safety equipment such as kneeling pads, safety knives, and PPE\n\n\nWho is a good fit?\n\nBe at least 18 years of age, have a valid driver's license and proof of auto insurance.Someone with a positive and professional attitude who is self-motivated and can work independently.Ability to drive your personal vehicle to a variety of store locations (mileage will be reimbursed).Ability to perform hard work in a fast-paced work environment and to meet the defined physical activities like repetitive lifting, bending, and carrying up to 25 lbs. Occasionally, pushing and pulling over 50 lbs. This includes physically moving our products from the stock rooms to store floor and stocking the store’s shelves.Previous retail / grocery experience is a plus.Live within 25 miles range from the primary location of: Las Vegas, Nevada.Secondary locations: NoneSchedule availability required: Open availability\n\n\nBusiness Unit Summary\n\nWe are the makers and bakers of iconic brands including Oreo, Chips Ahoy!, Ritz, Triscuit, Swedish Fish, Sour Patch Kids and many others. The United States is the largest market in the Mondelēz International family with a significant employee and manufacturing footprint. Here, we produce our well-loved household favorites to provide our consumers with the right snack, at the right moment, made the right way. We have corporate offices, sales, manufacturing and distribution locations throughout the U.S. to ensure our snacks are close at hand for our consumers across the country.\n\nMondelēz Global LLC is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected Veteran status, sexual orientation, gender identity, gender expression, genetic information, or any other characteristic protected by law. Applicants who require accommodation to participate in the job application process may contact 847-943-5460 for assistance.\n\nJob Type\n\nRegular\n\nField Sales\n\nSales",
    "length": 3791
  },
  {
    "id": 11,
    "description": "Overview\n\nFootlhills Pet Healthcare Clinic is looking for a Registered Veterinary Technician to join their team.\n\nLocation: 111 Healthy Trail. Mount Airy, NC 27020\n\nSalary: Up to $25/hr\n\nShift: We offer our employees a 4 day work week with rotating Saturdays.\n\nExperience highly preferred**\n\n\nOur office hours are as follows:\n\nMonday,- Thursday : 8:00 AM to 6:00 PM\n\nFriday: 8:00 AM to 5:00 PM\n\nSaturday: 8:00 AM to 11:30 AM\n\nSunday: Closed\n\nFoothills Pet Healthcare Clinic is designed to provide a full scope of veterinary services to accommodate dogs, cats, puppies, kittens, and pocket pets. Our goal is to strenghten the bond between people and their pets by providing medical, surgical and a variety of treatments and modalities. We utilize our team to the fullest.\n\nOur hospital is set apart by offering the latest therapies including regenerative therapies (Platelet-rich plasma (PRP) and Stem Cell Therapy). We offer orthopedic surgeries, physical therapy including and underwater treadmill, theraputic laser and acupuncture.\n\nWe have a wonderful mentorship program for those building their skill set. Mentors and Mentee's meet routinely to discuss areas of improvement as well as successes that have been made.\n\nWe have daily huddles to keep each team in the loop for the day. We also meet monthly to set goals, plan and have lunch and learns.\n\nWe are a team that likes to have fun while getting the job done.\n\n Job Summary:  Th e Registered Veterinary Technician provides leadership and training to the medical support staff in the operation of a small animal facility in accordance with hospital policy and procedures and provide s medical care to patients as allowed in the veterinary practice act. The Registered Veterinary Technician will be able to communicate effectively with team members and clients and have great attention to detail and organizational abilities.\n\nResponsibilities\n\nEssential Functions:\n\nThe following duties and responsibilities generally reflect the expectations of this job but are not intended to be all inclusive. The essential functions include the most significant tasks and are the essence of why the role exists; removing an essential duty would fundamentally alter the role.\n\n Maintain and uphold Core Values and Mission Statement of MVP.  Provide guidance to the support staff to assure that the shift flows well.  Mentor team members for career advancement and personal development towards goals.  Provide input to the hospital manager for 360-degree employee performance evaluations.  Provide patient care under the supervision and direction of a DVM.  Maintain excellent client communication.  Record all pertinent medical, client and case related information in the patient record accurately with appropriate grammar, terms, and accurate information.  Review medical records, estimates or discharge instructions with clients.  Answer client’s inquiries about basic animal care questions and routine procedures; handle client’s medical questions with confidence and direct to veterinarians when appropriate. \n\n\n Additional Functions: \n\n Provide client care for scheduling appointments, taking payments, and checking in clients.  Answer the phones in a courteous and informative way.  Provide feedback and changes to the training program.  Take part in jobs shadows or working interviews as necessary.  Take part in training as necessary.  Participate in any special cleaning duties.  Perform clinic upkeep as directed.  Perform equipment maintenance as directed.  Delegate additional cleaning duties as necessary during slow times in the absence of a supervisor.  Identify areas or items needing additional attention .  Performs other related duties as assigned. \n\n\nQualifications\n\nRequired Knowledge, Skills and Abilities:\n\n Must be proficient in a variety of skills ranging from but not limited to laboratory, pharmacy, radiology, surgery, dental and nursing skills.  Ability to demonstrate patience and composure in stressful situations, and ability to handle a fast-paced environment.  Ability to stay calm and efficient during a medical crisis.  Ability to give SQ, IM and IV injections.  Knowledge of usage, dosage, and common side-effects for commonly used prescription drugs and ability to readily explain them to the clients.  Knowledge of the common anesthesia and recovery states and ability to alert veterinarians when symptoms change or when concerns arise with hospitalized patients.  Ability to properly extubate, monitor temperature and recover a patient from anesthesia.  The employee must have mental processes for reasoning, remembering, mathematics, and language ability (reading, writing, and speaking the English language) to perform the duties proficiently.  The employee must be confident around pets. \n\n\nRequired Education and Experience:\n\n High School Diploma or equivalent required.  State Department of Regulation Licensing required.  1+ Years of Veterinary industry experience required. \n\n\n Physical Requirements: \n\n The employee must have the ability to stand, walk, stoop, kneel, crouch, and climb as well as manipulate (lift, carry, move) up to 50 pounds and over 50 pounds with a coworker.  The employee must be able to endure sitting, standing and walking on hard floor surfaces for extended periods of time.  The employee must possess sufficient ambulatory skills to perform duties while in hospital environment.  The employee must be able to work in noisy work conditions with sounds from animals and equipment that can be moderately high.  The employee will be routinely exposed to a variety of pets that may bite or scratch, and on occasion, exposed to anesthesia, radiation, biological hazards, and medication/controlled substances.  The employee must possess the ability to hear verbal instructions, client discourse and veterinary patients. The employee must have specific vision abilities which include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.  The employee must have good hand-eye coordination, arm-hand-finger dexterity with the ability to grasp and visual acuity to use a keyboard and operate equipment. \n\n\nTravel required: Minimal travel required, possibly for vendor visits and associate education.\n\nReasonable Accommodations\n\nApplicants with disabilities may be entitled to reasonable accommodation under the Americans with Disabilities Act and certain state or local laws. If you need a reasonable accommodation in order to perform the essential functions of a position, please send an e-mail to benefits@mvetpartners.com and let us know the nature of your request and your contact information.\n\nMission Veterinary Partners (MVP) is an equal opportunity employer. Hiring decisions are administered without regard to race, color, creed, religion, sex, pregnancy, sexual orientation, gender identity, age, national origin, ancestry, citizenship status, disability, veteran status, genetic information, or any other basis protected by applicable federal, state, or local law. We embrace diversity and are committed to creating an inclusive environment for all team members.",
    "length": 7139
  },
  {
    "id": 12,
    "description": "Neonatologist/NICU\n\nLocation(s): Arlington Heights, Illinois\n\nEndeavor Health is currently seeking an exceptional Neonatologist to join the Division of Neonatology. The successful candidate will have completed an accredited neonatology fellowship and be BE/BC in Pediatrics and Neonatal-Perinatal Medicine\n\nWhat You Will Need\n\nLicense: Illinois Medical License or License Pending\n\nCertification: The successful candidate for this position will have completed an accredited neonatology fellowship and be board certified/eligible by the American Board of Pediatrics in Pediatrics and Neonatal-Perinatal Medicine\n\nWhat You Will Do\n\nProviding in-house coverage in the Neonatal Intensive Care Unit at Northwest Community Hospital for an average of 1 week per month (Monday through Friday) during the day shift, with additional overnight weekday shifts and weekend shifts to total 1944 hours per year.Working one major summer holiday (Memorial Day, July 4 or Labor Day) and one major winter holiday (Thanksgiving Day, Christmas Eve, Christmas Day or New Year’s Day). These holiday shifts will be included in the total yearly shift requirement as outlined above.You may also have the opportunity to work additional hours providing in-house coverage at either Northwest Community Hospital or Evanston Hospital, and those additional hours will be compensated at the then-applicable moonlighting rate for neonatologists at NorthShore.Coverage duties include, but are not limited to, providing care for patients in the Neonatal Intensive Care Unit, rounding on unassigned newborns and hyperbilirubinemia infants, attending deliveries as needed, and evaluating and managing infants in the normal newborn nursery as needed.Provide teaching to physician assistant and nurse practitioner students and other learners while on call.Attend at the developmental follow-up clinic once per month.\n\nThe Department offers a competitive salary and benefits package, a highly collegial work atmosphere, and access to state-of-the art technology and equipment. As the principal academic affiliate of the Pritzker School of Medicine at The University of Chicago, academic appointment is available to qualified candidates.\n\nEndeavor Health is a fully integrated healthcare delivery system committed to providing access to quality, vibrant, community-connected care, serving an area of more than 4.2 million residents across six northeast Illinois counties. Our more than 25,000 team members and more than 6,000 physicians aim to deliver transformative patient experiences and expert care close to home across more than 300 ambulatory locations and eight acute care hospitals – Edward (Naperville), Elmhurst, Evanston, Glenbrook (Glenview), Highland Park, Northwest Community (Arlington Heights) Skokie and Swedish (Chicago) – all recognized as Magnet hospitals for nursing excellence. Located in Naperville, Linden Oaks Behavioral Health, provides for the mental health needs of area residents. For more information, visit endeavorhealth.org\n\nDiversity, equity and inclusion are at the core of our mission to support our team members and patients - irrespective of race, ethnicity, age, gender, sexual orientation or socioeconomic status. We believe that by recognizing and embracing our differences we create an organization that welcomes all to contribute and grow. We invite all candidates to our team, as we continue to build on the incredible value our diverse talent brings to our organization, our community and our patients.\n\nWhen you work for Endeavor Health, you will be part of an organization that encourages its employees to achieve career goals and maximize their professional potential.\n\nPlease explore our website (www.northshore.org) to better understand how Endeavor Health delivers on its mission to “help everyone in our communities be their best”.\n\nEndeavor Health is committed to working with and providing reasonable accommodation to individuals with disabilities. Please refer to the main career page for more information.\n\nEOE: Race/Color/Sex/Sexual Orientation/ Gender Identity/Religion/National Origin/Disability/Vets, VEVRRA Federal Contractor.\n\nQualified Candidates Are Encouraged To Apply Directly To This Posting Or May Submit Their CV To Dr. Matthew Pellerite, Division Head By Contacting\n\nMarty Murphy\n\nPhysician Recruiter\n\nEmail: mmurphy2@northshore.org",
    "length": 4359
  },
  {
    "id": 13,
    "description": "Raymond James Overview\n\nOne of the largest independent financial services firms in the country could be the place you build a career beyond your expectations. \n\nOur focus is on providing trusted advice and tailored, sophisticated strategies for individuals and institutions. Raymond James Financial is a diversified holding company, headquartered in St. Petersburg, FL. Raymond James provides financial services to individuals, corporations and municipalities through its subsidiary companies engaged primarily in investment and financial planning, in addition to capital markets and asset management.\n\nAt Raymond James, we are putting the power of perspectives into action and building an inclusive and diverse workforce that reflects our commitment to associates, and clients of the future. Our company values associate development and growth, offering opportunities through developmental programs, mentorships, and continuing education options.\n\nWe strive to ensure everyone feels welcomed, valued, respected and heard so that you can fully contribute your unique talents for the benefit of clients, your career, our firm and our communities. Raymond James is an equal opportunity employer and makes all employment decisions on the basis of merit and business needs.\n\nJob Summary\n\nEquity Capital Markets (“ECM”) Seasonal Associates at Raymond James play an integral role supporting the ECM Origination and Syndicate teams in executing IPOs, follow-on equity offerings, preferred offerings, and equity linked offerings. Seasonal Associates are given a high level of responsibility as members of the product-focused team and gain exposure to documents preparation related to the public and private issuance of stock, the targeting of investors for each offering using publicly available and proprietary data and will conduct competitive benchmarking analysis. Seasonal Associates are expected to work on multiple aspects of the transaction process, with a focus on new business proposals and offering execution. Seasonal Associates work independently on difficult assignments and are required to re-prioritize tasks on an ongoing basis.\n\nThis is a temporary role.\n\nWork Schedule: Up to 40 per week for a limited time, determined by department need.\n\nEssential Duties And Responsibilities\n\n Develop client presentations. Support the execution of equity, preferred, and equity liked offerings. Follow Raymond James equity research and provide updates to ECM and Investment Banking. Follow equity and equity linked new issues and keep ECM and Investment Banking informed about timing, pricing, and performance of offerings. Maintain files and group databases related to active and prospective deals. Perform other duties and responsibilities as assigned.\n\nQualifications:\n\nKnowledge, Skills, And Abilities\n\nKnowledge of\n\n Fundamental concepts, practices, and procedures of Equity Capital Markets. Fundamental investment concepts, practices, and procedures used in the securities industry. Financial markets and products.\n\nSkill in\n\n Communicating effectively, both orally and in writing. Analytical skills sufficient to assess and explain events in the market. Problem solving. Operating standard office equipment and using required software applications, including Microsoft Office and established databases.\n\nAbility to\n\n Maintain attention to detail in a fast paced, rapidly changing environment. Gather information, identify linkages and trends, and apply findings to reports. Attention to detail while maintaining a big picture orientation. Remain cognizant of our commitment to daily workflow and regulatory compliance during high volume activity. Think independently in order to market ideas. Organize, manage and track multiple detailed tasks and assignments with frequently changing priorities in a fast-paced work environment. Establish and maintain effective working relationships at all levels of the organization. Work independently as well as collaboratively within a team environment. Assume full responsibility and accountability for own actions. Demonstrate uncompromising adherence to ethical principles. Be proactive and demonstrate readiness and ability to initiate action.\n\nEducational/Previous Experience Requirements\n\nEducation/Previous Experience\n\n Currently enrolled in an accredited undergraduate or graduate degree program.\n\n~or~\n\n Any equivalent combination of experience, education, and/or training as approved by Human Resources.\n\nLicenses/Certifications:\n\nNone Required.\n\nLocation\n\nHybrid position – St. Petersburg office\n\nNo travel required.\n\n#wayup\n\nAt Raymond James our associates use five guiding behaviors (Develop, Collaborate, Decide, Deliver, Improve) to deliver on the firm's core values of client-first, integrity, independence and a conservative, long-term view.\n\nWe expect our associates at all levels to:\n\n Grow professionally and inspire others to do the same Work with and through others to achieve desired outcomes Make prompt, pragmatic choices and act with the client in mind Take ownership and hold themselves and others accountable for delivering results that matter Contribute to the continuous evolution of the firm\n\nAt Raymond James – as part of our people-first culture, we honor, value, and respect the uniqueness, experiences, and backgrounds of all of our Associates. When associates bring their best authentic selves, our organization, clients, and communities thrive. The Company is an equal opportunity employer and makes all employment decisions on the basis of merit and business needs.\n\nJob :\n\nInvestment Management\n\nPrimary Location :\n\nUS-FL-St. Petersburg-Saint Petersburg\n\nOrganization :\n\nSyndicate\n\nSchedule :\n\nFull-time\n\nShift :\n\nDay Job\n\nTravel :",
    "length": 5714
  },
  {
    "id": 14,
    "description": "Role :  Senior DevOps Engineer Location: Burkley Heights, NJ Experience : 8+ Years Visa : H4EAD, GC & USC \n What will you do:Build, manage, and deploy CI/CD pipelines.Strive for continuous improvement and build continuous integration, continuous development, and constant deployment pipeline.Implementing various development, testing, automation tools, and IT infrastructureOptimize and automate release/development cycles and processes.Be part of and help promote our DevOps culture.Identify and implement continuous improvements to the development practiceWhat you need to have:4+ years expertise with Microsoft Azure cloud-based infrastructure and services4+ years hands-on experience with CI/CD (YAML) pipelines for Azure DevOps4+years hands-on experience with K8S environment including Helm Charts & Config Maps.4+ years sound knowledge on scripting in languages such as PowerShell, bash scripting.3+ year’s experience in containerization with Azure Kubernetes, Docker etc.3+ years experience with Infrastructure as Code4+ years high proficiency with Windows-based systems and Linux-based systems Ability to write and update documentation.Demonstrate a logical, process orientated approach to problems and troubleshooting.",
    "length": 1227
  },
  {
    "id": 15,
    "description": "H-E-B Customers need you before they even enter our Stores! We need energetic and motivated Partners willing to work hard and have fun while making our Customers feel welcome. No matter what background you bring, or where you are in your career, we welcome you to join our community where People come first.\n\nAs a Service Representative (Parking Lot Attendant), you'll return carts to the Store, perform general clean-up duties, and help Customers, if needed\n\nOnce you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that make H-E-B The Greatest Omnichannel Retailing Company.\n\nDo you have a:\n\nHEART FOR PEOPLE... commitment to work hard to make sure People come first?\n\nHEAD FOR BUSINESS... recognition of what needs to be done before you're told?\n\nPASSION FOR RESULTS... a desire to help get the job done, whatever it takes?\n\nWe are looking for:\n\n ability to work hard, outside ability to work in a fast-paced environment\n\nWhat is the work?\n\nSanitation / Stocking:\n\n Collects carts from the parking lot Removes trash from carts prior to returning to cart storage area Cleans / picks up trash and debris from landscaping around the Store Maintains a clean environment in the front elevation of the Store Cleans, sweeps, mops, dusts, and maintains cleanliness and safety for entire Store Does Carts & Parts basket relocation and power-washing basket relocation for department setup Performs red basket fill up / retrieval Communicates supply needs to Front End Manager\n\nCustomer Service:\n\n Assists Customers in locating merchandise Performs duties with a total Store mindset\n\nWhat is your background?\n\n Company Orientation Basics of Safety\n\nDo you have what it takes to be a fit as an H-E-B Service Representative (Parking Lot Attendant)?\n\n Ability to work hard in extreme temperatures Ability to work in a fast-paced environment Ability to work around Customers, staying aware of their needs\n\nCan you...\n\n Frequently* stand, walk, bend, kneel, pull, push, stand, reach, squat, and walk Frequently be exposed to extreme (hot, cold), outside temperatures Demonstrate the ability to lift up to 20 lbs** While there may be exceptions, the measurements noted are generally defined as--Constantly: 5.5+ hours per 8-hour day; Frequently: 2.5 - 5.5 hours per 8-hour day; Occasionally: 0 - 2.5 hours per 8-hour day It is Partners' responsibility to never lift beyond their own safe lifting limit. If an item is too heavy to lift, push or pull, and / or carry, the Partner must break the box down into lighter, smaller, more manageable components, or ask for assistance from another Partner or a manager.\n\n09-2018",
    "length": 2797
  },
  {
    "id": 16,
    "description": "Work With Purpose\n\nAt Five Star Senior Living, our people are the critical link to those we serve, and it is their vitality, energy, and caring nature that allows us to fulfill our mission of enriching and inspiring the journey of life. In addition to nurturing and advancing the lives of our residents, our team members enjoy meaningful opportunities for personal and professional growth, within a supportive culture centered around advancing their lives, as well.\n\nThe Opportunity\n\nWe are seeking compassionate Resident Assistants (RA) to provide support for our community’s residents with the essential day-to-day tasks they can no longer perform or need help with. RAs are responsible for helping people with their daily tasks, such as laundry, cleaning, bathing, dressing, and taking their medication. Successful RAs are sensitive and respectful, and are passionate about helping those in need.\n\nWhat You’ll Do\n\nProvide Care\n\nHelping with personal hygiene, including bathing, grooming, and dressingSupporting residents with medication; taking medication, opening containers, opening prepackaged medication, reading medication labels for residents, observing residents taking medication, checking the self-administered dosage against the label of the container, and reassuring residents they have obtained and are taking the dosage as prescribed.Repositioning residents in bed and escorting them around the communityToileting, incontinent careTake vital signs, such as blood pressure, heart rate and pulse\n\n\nCommunicate\n\nObserve and report on residents’ health, escalating any problems efficiently and effectivelyDetail daily reports to Nurse, or designated charge person, at end of shiftProvide emotional support and serve as a source of comfort for residents and their loved onesRecognize abnormal changes in body functioning and report to a supervisor\n\n\nWhat You’ll Bring\n\nExperience & Education\n\nHigh School Diploma or equivalentAssociates degree or higher, focused on advancement into medical services, or similar, preferred\\\\CPR/First Aid Certification desired (unless required by the State)Previous experience in long-term care preferredValid, unrestricted CNA certification or State/Local equivalent required\n\n\nEngagement\n\nWorking experience alone, on a team, and on projects start to finishStrong emotional intelligence and listening skillsDedication to the medical field, especially towards working with the residentsMust pass State and company background checks and drug test.\n\n\nShift/Hours\n\nOvernight\n\nWe Got You\n\nWe see and support the whole you. Because investing in you, and all our team members, is the first step in making a difference in the lives of others.\n\nComprehensive Medical/Dental/Vision401k + MatchCompetitive PTOLife, Disability & other supplemental benefitsProfessional Development FundsWellness Coaching & Personal Support BenefitsRecognition & Reward Programs\n\n\nIs This You?\n\nBeyond checking off the boxes, we’re looking for someone who shares our deep sense of purpose and passion for advancing the lives of others.\n\nPuts People First – You have an authentic connection to our vision of a world in which the quality of life is ageless, and a desire to advance our culture by always respecting and empowering our team members, residents, and families.Customer Focused – You strive to build and strengthen customer loyalty by delivering exceptional hospitality, thoughtful solutions, and innovative customer attraction and retention strategies.Results Oriented – You’re forward thinking, seeing the big picture as you lead with empathy and drive to exceed results. You firmly believe that the way in which we achieve results is just as important as what we accomplish together.Drives Operational Excellence – You encourage a mindset of continuous improvement. You respect ideas, collaborate, and empower others to elevate how and what we deliver for our customers and each other.Embraces Change – You’re a change driver! A positive communicator who engages all key stakeholders to help them anticipate and embrace what’s next, you’re always adjusting the target for continuous improvement.\n\n\nEEOC\n\nFive Star prohibits discrimination against any applicant or employee with regard to or on the basis of race, color, religion, national or ethnic origin, age, ancestry, sex, pregnancy (including pregnancy, childbirth, lactation and related medical conditions), gender, gender identity and expression (including transgender), sexual orientation, mental or physical disability, military status, certain criminal records, genetic information (including characteristics and testing), HIV testing, a personal admission to a facility for the care and treatment of a mentally ill person and taking of parental leave or membership in any other category protected by applicable law. In addition to federal requirements, Five Star complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has communities and/or facilities. This policy applies to all terms and conditions of employment, including, but not limited to, recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\nIn addition, Five Star expressly prohibits any form of workplace harassment based on race, color, religion, national or ethnic origin, age, ancestry, sex, pregnancy (including pregnancy, childbirth, lactation and related medical conditions), gender, gender identity and expression (including transgender), sexual orientation, mental or physical disability, military status, certain criminal records, genetic information (including characteristics and testing), HIV testing, a personal admission to a facility for the care and treatment of a mentally ill person and taking of parental leave or membership in any other category protected by applicable law. We will not tolerate harassment of employees in the workplace, or in other settings in which employees may find themselves in connection with their employment. Improper interference with the ability of Five Star’s employees to perform their job duties may result in discipline up to and including discharge. Additionally, retaliation, including intimidation, threats, or coercion, because an employee or applicant has objected to discrimination harassment or retaliation, engaged or may engage in filing a complaint, assisted in a review, investigation, or hearing or have otherwise sought to obtain their legal rights under any federal, state, or local law is prohibited and will not be tolerated.",
    "length": 6589
  },
  {
    "id": 17,
    "description": "Electrician– Blue Sky WRF\nHighlights of the job: \nWe are recruiting for an exceptional full time Electrician to serve our Blue Sky Wastewater Reclamation Facility in Taylor, TX. The selected Candidate(s) will be responsible for the installation, configuration, troubleshooting, calibration, the repair and maintaining of electronic instrumentation, electrical equipment, fixtures & other various pieces of electrical items. The equipment services includes but is not limited to: motors, MCC’s, VFD’s, transformers, transmitters, actuators, digital and analog instrumentation, breakers and more. This position is subject to call back, overtime, weekend and holiday emergency call-outs and on-call duty. \n \nWhat you’d be responsible for: \nRead schematics, wiring diagrams and shop drawings for the purpose of installation, troubleshooting and repairing of major systems and minor subsystems and components. Installs, alters, maintains and repairs electrical wiring systems, equipment (high and low voltage), air distribution systems, motors, transformers, blowers, and other equipment within the facility. Ability to install, calibration, troubleshoot and repair various pieces of instrumentation (digital and analog) within the facility: level, pressure, PDIT, temperature, analytical equipment (pH, turbidity, TDS…etc), limit switches, RTD’s and thermocouples & flow meters. Ability to effectively troubleshoot electrical systems of all voltages 24vdc up to 12470vac in a thorough and systematic manner. Performs daily, weekly, monthly, quarterly, bi-annual and annual checks, tests, calibrations on all types of equipment within the facility. Ability to use various types of test equipment, computers, PC software, analyzer programs, multi-meter, megger, field communication devices, loop calibrator/tester, thermal imager, vibration equipment and ultrasonic equipment. Performs detailed record-keeping functions for work completed, warehouse inventory and for completing and closing out CMMS work orders. Ability to bend, install and terminate conduit of all types and SS tubing where needed and pull/terminate cables of various type/size. Familiar with NFPA 70E, NFPA 70B and ANSI/NETA MTS.Knowledge of and understanding of safety procedures and requirements according to OSHA standards and applicable electrical code.Must be able to work overtime and be part of an on-call rotation as required. Regular and timely attendance is required for this position. Or other tasks as required. \nWhat’s required to be successful: \nJob requires high school diploma or equivalent.2 or more years of experience as a Utility, Heavy Commercial or Industrial Electrical, Instrumentation and Controls Technician OR I/E (Instrumentation and Electrical) Technician.Degree or Certification in Instrumentation and Controls OR Journeyman License preferred, but not required. Valid Texas Driver’s License.Standard process control and operation practices associated with a utility and/or industrial industry.Knowledge in the use of personal computers and numerous software applications such as Excel, Word, MS Outlook, PowerPoint, Access, Notebook…etc. Knowledge of condition based and preventative maintenance protocols related to electrical equipment. Comprehend and interpret drawings, specifications and blueprints. Ability to define problems, collect data, establishes facts, and draw valid conclusions;Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. \n \nOther important facts about this job: \nAs and EPCOR employee, you would enjoy a variety of benefits such as a competitive salary, an incentive award program, excellent benefits package including medical, dental, vision and other coverages, retirement plan with substantial company contribution, generous time off schedule, training opportunities, tuition reimbursement and certification support. We’ve been voted as a Best Places to Work employer and we value the safety of each of our team members through our robust safety training and celebration of safety milestones. \nHeadquartered in Phoenix, EPCOR USA owns, operates and builds water, wastewater and natural gas infrastructure and is among the largest private water utilities in the Southwest. EPCOR USA is an indirect, wholly owned subsidiary of EPCOR Utilities Inc. We invest in and look after our communities and environment. We are proud of the work we do and the people we hire to do it. \n \nPlease note the following information: \nThis position would not provide sponsorship for candidates requiring US work authorization (except for current EPCOR employees in Canada). A requirement of working for EPCOR is that you are at least 18 years of age and legally entitled to work in the United States.If you are considered for the position, clearance on all applicable background checks (which may include criminal, driving and educational) and professional reference checks is required. To meet the physical demands required of some positions, candidates must be in good physical condition and willing to work in all weather conditions. Clearance on pre-employment drug testing will be required.  \nInternal Applicants: please ensure that you are using your “@epcor.com” email address.\n \nFollow us on LinkedIn, Twitter, Glassdoor or Facebook!\n \n\n \n \n \nFollow us on LinkedIn, Twitter or Facebook!",
    "length": 5397
  },
  {
    "id": 18,
    "description": "Netsurit Inc (Vital I/O division). is seeking a dynamic and results-driven New Business Sales Executive to join our New York team. In this role, you will be responsible for identifying new business opportunities, engaging potential clients, and closing sales to expand our MSP services in the Albuquerque area and beyond. Your goal will be to drive revenue growth and contribute to our company’s expansion.\nResponsibilities:Develop and execute strategies for lead generation, sales, and all other matters related to revenue generation.Engage potential clients through cold calling, email campaigns, networking events, and social media outreach.Present our MSP services to potential clients through direct communication, face-to-face meetings, networking events, and presentations.Negotiate contracts and close agreements to maximize profits.Maintain a thorough knowledge of the MSP market, our services, and emerging trends.Work closely with the marketing team to identify and pursue targeted sales opportunities in Albuquerque and surrounding areas.\nQualifications:Bachelor’s degree in Business, Marketing, IT, or a related field.3+ years of sales experience, with a proven track record of achieving sales targets, preferably in the MSP, IT, or technology sectors.Strategic account planning, opportunity qualification and creation, stakeholder and executive communication, needs analysis, value engineering (business case design and value proposition design), services/partner engagement, opportunity management, pipeline management and deal negotiation required.Ability to work independently and as part of a team in a fast-paced environment.Knowledge of the Albuquerque business environment and network is a plus.\n\nCompetencies SkillsProspecting & Lead GenerationTime Management and OrganizationIndustry KnowledgeAssertivenessResilience and Persistence · Communication (verbal / written) · Presentation skills · Sales techniques and closing skills · Lead pipeline management · Product and Service knowledge",
    "length": 2009
  },
  {
    "id": 19,
    "description": "The ideal candidate will have experience leading a team and managing the daily operation of the business. They will be responsible for maintaining the standard of work from employees as well as onboarding and hiring new team members.  ResponsibilitiesProvide leadership and direction to a team of people Manage operations and finances of business Recruit and train new hires on business practices Drive development of employees Ensure that quality of work or service is maintained\nQualificationsManagement and Customer Service experience Strong administrative skills Demonstrated ability to lead Comfort working with budgets, payroll, revenue and forecasting Strong communications skills",
    "length": 687
  },
  {
    "id": 20,
    "description": "Position Summary\n\nThe General Warehouse Associate is responsible for filling customer orders in a manner that meets company standards for safety, security and productivity. Efficiently fills customer orders for shipment, ensuring that the correct number and type of product is loaded and shipped. Ensure outbound shipments are accurate and free of damage. Ability to understand all aspects of inbound unloading operations within a distribution center, working in teams to accomplish all job duties.\n\nPosition Description\n\nEssential Duties and Responsibilities include the following. Other duties may be assigned.\n\nSupport the inbound and outbound operationUnload trailers by handMoving furniture with dolliesAbility to work in a warehouse environment, withstanding climate changesProper lifting techniques, lift, push, stooping twisting, bendingAssembly of furnitureUse of RF Scanners/ scanning systemEnsure outbound picked furniture matches invoice before loading into contractor’s vehicle for deliveryEnsures that outbound furniture does not have any damages or flawsEfficiently prepares customers’ orders monitors and ensures that outbound furniture is properly assembledAble to work in a fast-paced environmentConduct operations in compliance with OSHA standardsMaintain a clean and organized workspaceMeet company standards for productivityAble to work a flexible schedule including weekends and holidays\n\nQualifications\n\nEducation/Experience: High School Diploma or GED equivalent. 1-2 years experience of forklift operation in a fast paced, warehouse environment. Equivalent combination of education and experience will be considered.\n\nComputer Skills: To perform this job successfully, an individual must have experience in Microsoft Office programs. Knowledge of design software programs is a plus.\n\nPosition Hiring Range\n\nThe hiring pay range provides a guide for what we would reasonably pay for the position. Pay will be determined by several factors, including but not limited to: applicant’s education, relevant work experience, knowledge, skills and abilities, as well as internal equity and alignment with geographic market data. Living Spaces reserves the right to modify this pay range at any time. Pay is determined by various factors including market demand, applicable skills, work experience and education, location, company budget, and in-demand skill sets.\n\nCompensation: $15.15 - $19.65\n\nRetail, Guest Services, and Distribution Center Team Members are eligible to receive team bonus based on meeting specific goals and KPI’s.\n\nBenefits Include\n\nMedicalDentalVision401(k) (full and part time eligible)VacationSick TimeFlex Spending AccountEmployee Assistance Program\n\nFor more details, please visit our website at: Careers (livingspaces.com)\n\nEqual Opportunity Employer\n\nIt is our policy to abide by all federal, state, and local laws prohibiting employment discrimination based solely on a person’s race, color, religious creed, sex, national origin, ancestry, citizenship status, pregnancy, physical disability, mental disability, age, military status, or status as a Vietnam-era or special disabled veteran, marital status, registered domestic partner or civil union status, gender (including sex stereotyping and gender identity or expression), medical condition (including but not limited to, cancer related or HIV/AIDS related), sexual orientation, or any other protected status except where a reasonable, bona fide occupational qualification exists.\n\nE-Verify\n\nLiving Spaces participates in E-Verify. All newly-hired team members are queried through this electronic system established by the Department of Homeland Security (DHS) and the Social Security Administration (SSA) to verify their identity and employment eligibility.\n\nApplicant Privacy\n\n#distributioncenter",
    "length": 3799
  }
]